In [18]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [48]:
# 创建一个一维Series, 通过python数组创建, 索引可重复
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=["广州", "上海", "北京", "广州", "北京", "广州"])
s

广州    1.0
上海    3.0
北京    5.0
广州    NaN
北京    6.0
广州    8.0
dtype: float64

In [46]:
# 创建一个一维Series, 通过python字典创建, 索引不可重复
s = pd.Series({"广州": 200, "上海": 300, "北京": 400})
s

广州    200
上海    300
北京    400
dtype: int64

In [107]:
# 创建一个一维Series, 通过numpy数组创建
s = pd.Series(np.arange(5,8), index=['a', 'b', 'a'])
s

a    5
b    6
a    7
dtype: int32

In [108]:
# DataFrame(多特征数据,既有行索引,又有列索引)
# 创建一个3行4列的DataFrame类型数据
data_3_4 = pd.DataFrame(np.arange(10,22).reshape(3,4))
print(data_3_4)

    0   1   2   3
0  10  11  12  13
1  14  15  16  17
2  18  19  20  21

In [109]:
# 打印第一行数据
print(data_3_4[:1])

    0   1   2   3
0  10  11  12  13

In [110]:
# 打印第一列数据
print(data_3_4[:][0])

0    10
1    14
2    18
Name: 0, dtype: int32

In [200]:
# DataFrame属性
tmp_df = pd.DataFrame({"id":[101,102,103,104,105],
                      "name":['张三','李四','王五','赵六','陈七'],
                      "age":[18,17,np.nan,18,17],
                      "sex":['女','男','男',np.nan,'女'],
                      "score":[69,59,70,40,np.nan]},
                     columns=['id','name','age','sex','score'])
tmp_df = pd.DataFrame({"id":range(1,10),
                      "name":['张思山','陈梓涵','李锐锋','张昆纬','王鸿达','柯南','琦玉','张诗兰','王梦竹'],
                      "age":[16,np.nan,17,18,np.nan,19,17,np.nan,18],
                      "sex":['女','男','男',np.nan,'女','男','男',np.nan,'女'],
                      "score":[69,59,70,40,np.nan,66,np.nan,80,95]})
tmp_df

   id name   age  sex  score
0   1  张思山  16.0    女   69.0
1   2  陈梓涵   NaN    男   59.0
2   3  李锐锋  17.0    男   70.0
3   4  张昆纬  18.0  NaN   40.0
4   5  王鸿达   NaN    女    NaN
5   6   柯南  19.0    男   66.0
6   7   琦玉  17.0    男    NaN
7   8  张诗兰   NaN  NaN   80.0
8   9  王梦竹  18.0    女   95.0

In [201]:
# 数据维度
tmp_df.shape

(9, 5)

In [202]:
# 每列数据的类型信息
tmp_df.dtypes

id         int64
name      object
age      float64
sex       object
score    float64
dtype: object

In [203]:
# 数据的维数
tmp_df.ndim

2

In [204]:
# 数据的索引(起/始/步长)
tmp_df.index

RangeIndex(start=0, stop=9, step=1)

In [205]:
# 每列属性名称
tmp_df.columns

Index(['id', 'name', 'age', 'sex', 'score'], dtype='object')

In [206]:
# 通过数组显示数据
tmp_df.values

array([[1, '张思山', 16.0, '女', 69.0],
       [2, '陈梓涵', nan, '男', 59.0],
       [3, '李锐锋', 17.0, '男', 70.0],
       [4, '张昆纬', 18.0, nan, 40.0],
       [5, '王鸿达', nan, '女', nan],
       [6, '柯南', 19.0, '男', 66.0],
       [7, '琦玉', 17.0, '男', nan],
       [8, '张诗兰', nan, nan, 80.0],
       [9, '王梦竹', 18.0, '女', 95.0]], dtype=object)

In [207]:
# 整体查询
# 查看前5行
tmp_df.head(5)

   id name   age  sex  score
0   1  张思山  16.0    女   69.0
1   2  陈梓涵   NaN    男   59.0
2   3  李锐锋  17.0    男   70.0
3   4  张昆纬  18.0  NaN   40.0
4   5  王鸿达   NaN    女    NaN

In [208]:
# 查看最后5行
tmp_df.tail(5)

   id name   age  sex  score
4   5  王鸿达   NaN    女    NaN
5   6   柯南  19.0    男   66.0
6   7   琦玉  17.0    男    NaN
7   8  张诗兰   NaN  NaN   80.0
8   9  王梦竹  18.0    女   95.0

In [209]:
print(tmp_df)
# 查看描述信息
print(tmp_df.describe())
#count:总计非空值数量
#mean:平均值
#std:标准偏差
#min:最小值
#25%:百分之25的数据集情况
#50%:百分之50的数据集情况
#75%:百分之75的数据集情况
#max:最大值

   id name   age  sex  score
0   1  张思山  16.0    女   69.0
1   2  陈梓涵   NaN    男   59.0
2   3  李锐锋  17.0    男   70.0
3   4  张昆纬  18.0  NaN   40.0
4   5  王鸿达   NaN    女    NaN
5   6   柯南  19.0    男   66.0
6   7   琦玉  17.0    男    NaN
7   8  张诗兰   NaN  NaN   80.0
8   9  王梦竹  18.0    女   95.0
             id        age      score
count  9.000000   6.000000   7.000000
mean   5.000000  17.500000  68.428571
std    2.738613   1.048809  17.057326
min    1.000000  16.000000  40.000000
25%    3.000000  17.000000  62.500000
50%    5.000000  17.500000  69.000000
75%    7.000000  18.000000  75.000000
max    9.000000  19.000000  95.000000

In [210]:
# 索引查询
# 找出年龄大于等于18岁的人
tmp_df[tmp_df["age"]>=18]

   id name   age  sex  score
3   4  张昆纬  18.0  NaN   40.0
5   6   柯南  19.0    男   66.0
8   9  王梦竹  18.0    女   95.0

In [211]:
# 根据分数排序, ascending默认为True(升序)
tmp_df.sort_values(by="score", ascending=False).head(5)

   id name   age  sex  score
8   9  王梦竹  18.0    女   95.0
7   8  张诗兰   NaN  NaN   80.0
2   3  李锐锋  17.0    男   70.0
0   1  张思山  16.0    女   69.0
5   6   柯南  19.0    男   66.0

In [212]:
# 年龄平均值
tmp_df["age"].mean()

17.5

In [213]:
# 数据处理
print(tmp_df)
# 找到存在缺失值的样本

   id name   age  sex  score
0   1  张思山  16.0    女   69.0
1   2  陈梓涵   NaN    男   59.0
2   3  李锐锋  17.0    男   70.0
3   4  张昆纬  18.0  NaN   40.0
4   5  王鸿达   NaN    女    NaN
5   6   柯南  19.0    男   66.0
6   7   琦玉  17.0    男    NaN
7   8  张诗兰   NaN  NaN   80.0
8   9  王梦竹  18.0    女   95.0

In [214]:
# 删除存在缺失值的样本
tmp_df.dropna()

   id name   age sex  score
0   1  张思山  16.0   女   69.0
2   3  李锐锋  17.0   男   70.0
5   6   柯南  19.0   男   66.0
8   9  王梦竹  18.0   女   95.0

In [219]:
# 使用平均值填充缺失值并替换原df
# tmp_df["score"].fillna(tmp_df["score"].mean(), inplace=True)
tmp_df["score"].fillna(tmp_df["score"].mean())
tmp_df

   id name   age  sex  score
0   1  张思山  16.0    女   69.0
1   2  陈梓涵   NaN    男   59.0
2   3  李锐锋  17.0    男   70.0
3   4  张昆纬  18.0  NaN   40.0
4   5  王鸿达   NaN    女    NaN
5   6   柯南  19.0    男   66.0
6   7   琦玉  17.0    男    NaN
7   8  张诗兰   NaN  NaN   80.0
8   9  王梦竹  18.0    女   95.0

In [226]:
df1 = pd.DataFrame({"id":range(1,6),
                      "name":['张思山','李锐锋','王鸿达','柯南','琦玉'],
                      "age":[16,18,np.nan,19,'?'],
                      "sex":['女','?','女','男','女'],
                      "score":[59,70,40,np.nan,80],
                      "date":["2019-03-05 10:20:23",
                             "2019-03-04 20:30:38",
                             "2019-03-03 11:12:14",
                             "2019-03-04 16:40:56",
                             "2019-03-05 08:03:13"]})
df1

   id name  age sex  score                 date
0   1  张思山   16   女   59.0  2019-03-05 10:20:23
1   2  李锐锋   18   ?   70.0  2019-03-04 20:30:38
2   3  王鸿达  NaN   女   40.0  2019-03-03 11:12:14
3   4   柯南   19   男    NaN  2019-03-04 16:40:56
4   5   琦玉    ?   女   80.0  2019-03-05 08:03:13

In [227]:
# 预处理把数据中的?替换为np.nan
df1.replace(to_replace="?", value=np.nan)

   id name   age  sex  score                 date
0   1  张思山  16.0    女   59.0  2019-03-05 10:20:23
1   2  李锐锋  18.0  NaN   70.0  2019-03-04 20:30:38
2   3  王鸿达   NaN    女   40.0  2019-03-03 11:12:14
3   4   柯南  19.0    男    NaN  2019-03-04 16:40:56
4   5   琦玉   NaN    女   80.0  2019-03-05 08:03:13

In [231]:
# 将数据中的时间戳转换为可读日期(最小分度值为秒(s)的计量单位)
# df1["date"] = pd.to_datetime(df1["date"], unit="s")
# 从日期中拆分新的列(年月周)
df1["year"] = pd.DatetimeIndex(df1["date"]).year
df1["month"] = pd.DatetimeIndex(df1["date"]).month
df1["weekday"] = pd.DatetimeIndex(df1["date"]).weekday
df1

   id name  age sex  score                 date  year  month  weekday
0   1  张思山   16   女   59.0  2019-03-05 10:20:23  2019      3        1
1   2  李锐锋   18   ?   70.0  2019-03-04 20:30:38  2019      3        0
2   3  王鸿达  NaN   女   40.0  2019-03-03 11:12:14  2019      3        6
3   4   柯南   19   男    NaN  2019-03-04 16:40:56  2019      3        0
4   5   琦玉    ?   女   80.0  2019-03-05 08:03:13  2019      3        1

In [242]:
# 合并数据表
df2 = pd.DataFrame({"user_id":range(1,6),
                      "name":['张思山','李锐锋','王鸿达','柯南','琦玉'],
                      "age":[16,18,17,19,18]})
df3 = pd.DataFrame({"goods_id":['G01','G20','G31'],
                      "goods_name":['手机','WIFI','床']})
df4 = pd.DataFrame({"order_id":['bh0481','bh0421','bh0490'],
                    "user_id":[1,3,4],
                    "goods_name":['手机','手机','床']})

In [243]:
print(df2)
print(df3)
print(df4)

   user_id name  age
0        1  张思山   16
1        2  李锐锋   18
2        3  王鸿达   17
3        4   柯南   19
4        5   琦玉   18
  goods_id goods_name
0      G01         手机
1      G20       WIFI
2      G31          床
  order_id  user_id goods_name
0   bh0481        1         手机
1   bh0421        3         手机
2   bh0490        4          床

In [244]:
# 合并字段user_id,以df2为主导合并df4生成df2_4
df2_4 = pd.merge(df2, df4, how="left", on=['user_id', 'user_id'])
df2_4

   user_id name  age order_id goods_name
0        1  张思山   16   bh0481         手机
1        2  李锐锋   18      NaN        NaN
2        3  王鸿达   17   bh0421         手机
3        4   柯南   19   bh0490          床
4        5   琦玉   18      NaN        NaN

In [245]:
# 合并字段goods_name,以df2_4为主导合并df3生成df2_4_3
df2_4_3 = pd.merge(df2_4, df3, how="left", on=['goods_name', 'goods_name'])
df2_4_3

   user_id name  age order_id goods_name goods_id
0        1  张思山   16   bh0481         手机      G01
1        2  李锐锋   18      NaN        NaN      NaN
2        3  王鸿达   17   bh0421         手机      G01
3        4   柯南   19   bh0490          床      G31
4        5   琦玉   18      NaN        NaN      NaN

In [249]:
# 建立交叉表(用于计算分组的频率)
# 交叉表,表示用户年龄和商品名间的关系
user_goods = pd.crosstab(df2_4_3['age'], df2_4_3['goods_name'])
user_goods

goods_name  床  手机
age
16          0   1
17          0   1
19          1   0

In [316]:
cpdf = pd.DataFrame({"id":range(1,10),
                      "name":['张思山','陈梓涵','李锐锋','张昆纬','王鸿达','柯南','琦玉','张诗兰','王梦竹'],
                      "age":[16,np.nan,17,18,np.nan,19,17,np.nan,18],
                      "sex":['女','男','男',np.nan,'女','男','男',np.nan,'女'],
                      "score":[69,59,70,40,np.nan,66,np.nan,80,95],
                      "country":['CN','US','US','JP','CN','JP','US','CN','CN'],
                      "province":['GZ','U1','U2','J1','BJ','J2','U1','SZ','GZ']})
print(cpdf)
# 统计每个年龄学生的数量
cpdf.groupby(['country']).count()

   id name   age  sex  score country province
0   1  张思山  16.0    女   69.0      CN       GZ
1   2  陈梓涵   NaN    男   59.0      US       U1
2   3  李锐锋  17.0    男   70.0      US       U2
3   4  张昆纬  18.0  NaN   40.0      JP       J1
4   5  王鸿达   NaN    女    NaN      CN       BJ
5   6   柯南  19.0    男   66.0      JP       J2
6   7   琦玉  17.0    男    NaN      US       U1
7   8  张诗兰   NaN  NaN   80.0      CN       SZ
8   9  王梦竹  18.0    女   95.0      CN       GZ

         id  name  age  sex  score  province
country
CN        4     4    2    3      3         4
JP        2     2    2    1      2         2
US        3     3    2    3      2         3

In [317]:
# 统计每个年龄学生男女的数量
cpdf.groupby(['country', 'province']).count()

                  id  name  age  sex  score
country province
CN      BJ         1     1    0    1      0
        GZ         2     2    2    2      2
        SZ         1     1    0    0      1
JP      J1         1     1    1    0      1
        J2         1     1    1    1      1
US      U1         2     2    1    2      1
        U2         1     1    1    1      1

In [339]:
# 按照国家对数据集进行分类聚合并重建索引(将country变为普通列)
print(cpdf.groupby(['country']).sum().reset_index()[['country', 'score']])
cpadf = cpdf.groupby(['country']).count().reset_index()
cpadf

  country  score
0      CN  244.0
1      JP  106.0
2      US  129.0

  country  id  name  age  sex  score  province
0      CN   4     4    2    3      3         4
1      JP   2     2    2    1      2         2
2      US   3     3    2    3      2         3

In [319]:
# 
cpdf.sort_values('', ascending=False)

  country  score
0      CN  244.0
2      US  129.0
1      JP  106.0